Revit 2027 API
TransmissionData.IsDocumentTransmitted Method
 Determines whether the document at a given file location is transmitted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsDocumentTransmitted(
	ModelPath filePath
)
Public Shared Function IsDocumentTransmitted (
	filePath As ModelPath
) As Boolean
public:
static bool IsDocumentTransmitted(
	ModelPath^ filePath
)
static member IsDocumentTransmitted :
        filePath : ModelPath -> bool
Parameters
filePath ModelPath
 The path to the document whose transmitted state will be checked.
Return Value
Boolean
 True if the document is a transmitted file, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TransmissionData Class
Autodesk.Revit.DB Namespace